In [1]:
import pandas as pd

In [4]:
Dict = {"Age": pd.Series([25, 30, 35], index=["Sylvie", "Gilles", "Sylvain"]),
         "Ville": pd.Series(["Lorient", "Angers", "Vannes", "Le Mans"], index=["Sylvie", "Gilles", "Sylvain", "Thomas"])}

In [5]:
Dict

{'Age': Sylvie     25
 Gilles     30
 Sylvain    35
 dtype: int64,
 'Ville': Sylvie     Lorient
 Gilles      Angers
 Sylvain     Vannes
 Thomas     Le Mans
 dtype: object}

In [6]:
DF = pd.DataFrame(Dict)
DF

          Age    Ville
Gilles   30.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas    NaN  Le Mans

In [7]:
print(type(Dict))
print(type(Dict["Ville"]))

<class 'dict'>
<class 'pandas.core.series.Series'>

In [8]:
print(DF.index)
print(DF.columns)

Index(['Gilles', 'Sylvain', 'Sylvie', 'Thomas'], dtype='object')
Index(['Age', 'Ville'], dtype='object')

In [9]:
Dict = {"Prénom": ["Sylvie", "Gilles", "Sylvain", "Thomas"], "Age": [25, 30, 35, 40]}

In [10]:
DF = pd.DataFrame(Dict)
print(DF)

    Prénom  Age
0   Sylvie   25
1   Gilles   30
2  Sylvain   35
3   Thomas   40

In [11]:
DF = pd.DataFrame(Dict, index = ["L1", "L2", "L3", "L4"])
print(DF)

     Prénom  Age
L1   Sylvie   25
L2   Gilles   30
L3  Sylvain   35
L4   Thomas   40

In [13]:
DF = pd.DataFrame(Dict, index = range(1, 5))
print(DF)

    Prénom  Age
1   Sylvie   25
2   Gilles   30
3  Sylvain   35
4   Thomas   40

In [14]:
Dict = {"Age": pd.Series([25, 30, 35], index=["Sylvie", "Gilles", "Sylvain"]),
         "Ville": pd.Series(["Lorient", "Angers", "Vannes", "Le Mans"], index=["Sylvie", "Gilles", "Sylvain", "Thomas"])}
DF = pd.DataFrame(Dict)
DF

          Age    Ville
Gilles   30.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas    NaN  Le Mans

In [15]:
DF["Age"]

Gilles     30.0
Sylvain    35.0
Sylvie     25.0
Thomas      NaN
Name: Age, dtype: float64

In [16]:
DF.Age

Gilles     30.0
Sylvain    35.0
Sylvie     25.0
Thomas      NaN
Name: Age, dtype: float64

In [29]:
print(DF)
print("*********************")
print(DF.loc["Gilles"])
print("*********************")
print(DF.iloc[1])

          Age    Ville
Gilles   31.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas    NaN  Le Mans
*********************
Age        31.0
Ville    Angers
Name: Gilles, dtype: object
*********************
Age        35.0
Ville    Vannes
Name: Sylvain, dtype: object

In [30]:
print(DF["Ville"]["Sylvie"])
print(DF["Ville"].loc["Sylvie"])
print(DF["Ville"].iloc[2])

Lorient
Lorient
Lorient

In [41]:
DF["Age"]["Thomas"] = 20
DF["Age"].loc["Gilles"] = 34
DF

/tmp/ipykernel_5557/367474900.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  DF["Age"]["Thomas"] = 20
/usr/lib64/python3.10/site-packages/pandas/core/indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

          Age    Ville
Gilles   34.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas   20.0  Le Mans

In [44]:
DF_Notes = pd.DataFrame({
         "Big data":  pd.Series([11.0, 15.0, 10.0,10.0], index=["Sylvie", "Gilles", "Sylvain", "Thomas"]),
         "Hadoop": pd.Series([18.0, 20.0, 17.0,18.0], index=["Sylvie", "Gilles", "Sylvain", "Thomas"]),
         "Spark": pd.Series([15.0, 7.0, 10.0,20.0], index=["Sylvie", "Gilles", "Sylvain", "Thomas"]),
         "Java": pd.Series([18.0, 20.0, 10.0,8.0], index=["Sylvie", "Gilles", "Sylvain", "Thomas"])})
DF_Notes

         Big data  Hadoop  Spark  Java
Sylvie       11.0    18.0   15.0  18.0
Gilles       15.0    20.0    7.0  20.0
Sylvain      10.0    17.0   10.0  10.0
Thomas       10.0    18.0   20.0   8.0

In [48]:
print(DF_Notes.sum(axis=1))
print(DF_Notes.sum(axis=0))

Sylvie     62.0
Gilles     62.0
Sylvain    47.0
Thomas     56.0
dtype: float64
Big data    46.0
Hadoop      73.0
Spark       52.0
Java        56.0
dtype: float64

In [49]:
DF_Notes.mean(axis=1)

Sylvie     15.50
Gilles     15.50
Sylvain    11.75
Thomas     14.00
dtype: float64

In [51]:
DF_Notes.min(axis=1)

Sylvie     11.0
Gilles      7.0
Sylvain    10.0
Thomas      8.0
dtype: float64

In [52]:
DF_Notes.max(axis=1)

Sylvie     18.0
Gilles     20.0
Sylvain    17.0
Thomas     20.0
dtype: float64

In [53]:
DF_Notes.describe()

        Big data     Hadoop      Spark       Java
count   4.000000   4.000000   4.000000   4.000000
mean   11.500000  18.250000  13.000000  14.000000
std     2.380476   1.258306   5.715476   5.887841
min    10.000000  17.000000   7.000000   8.000000
25%    10.000000  17.750000   9.250000   9.500000
50%    10.500000  18.000000  12.500000  14.000000
75%    12.000000  18.500000  16.250000  18.500000
max    15.000000  20.000000  20.000000  20.000000

In [54]:
Res = DF_Notes[(DF_Notes["Java"] >= 15)]
Res

        Big data  Hadoop  Spark  Java
Sylvie      11.0    18.0   15.0  18.0
Gilles      15.0    20.0    7.0  20.0

In [55]:
Res.Java

Sylvie    18.0
Gilles    20.0
Name: Java, dtype: float64

In [56]:
Res = DF_Notes[(DF_Notes["Java"] >= 15) & (DF_Notes["Spark"] >= 10)]
Res

        Big data  Hadoop  Spark  Java
Sylvie      11.0    18.0   15.0  18.0

In [58]:
Res[["Spark", "Java"]]

        Spark  Java
Sylvie   15.0  18.0

In [60]:
Dict = {'Région': ['Nouvelle-Aquitaine', 'Normandie', 'Normandie', 'Ile-de-France', 'Ile-de-France',
                   'Grand Est', 'Grand Est', 'Grand Est'], 
          'Université': ['Université de Poitiers', 'Université de Rouen', 'Université de Rouen',
                     'Université de Paris', 'Université de Paris', 'Université de Reims', 'Université de Reims',
                         'Université de Reims'],             
          'Nom': ['Gilles', 'Laura', 'Sylvain', 
                   'Thomas', 'Sylvie', 'Luc', 'Marc', 'Hugo'], 
          'Spark': [14, 14.5, 15, 7.5, 18, 20, 19, 14],
          'Scala': [15, 10, 11, 9, 10.5, 18.5, 16, 16]}
Dict

{'Région': ['Nouvelle-Aquitaine',
  'Normandie',
  'Normandie',
  'Ile-de-France',
  'Ile-de-France',
  'Grand Est',
  'Grand Est',
  'Grand Est'],
 'Université': ['Université de Poitiers',
  'Université de Rouen',
  'Université de Rouen',
  'Université de Paris',
  'Université de Paris',
  'Université de Reims',
  'Université de Reims',
  'Université de Reims'],
 'Nom': ['Gilles',
  'Laura',
  'Sylvain',
  'Thomas',
  'Sylvie',
  'Luc',
  'Marc',
  'Hugo'],
 'Spark': [14, 14.5, 15, 7.5, 18, 20, 19, 14],
 'Scala': [15, 10, 11, 9, 10.5, 18.5, 16, 16]}

In [61]:
DF = pd.DataFrame(Dict)
DF

               Région              Université      Nom  Spark  Scala
0  Nouvelle-Aquitaine  Université de Poitiers   Gilles   14.0   15.0
1           Normandie     Université de Rouen    Laura   14.5   10.0
2           Normandie     Université de Rouen  Sylvain   15.0   11.0
3       Ile-de-France     Université de Paris   Thomas    7.5    9.0
4       Ile-de-France     Université de Paris   Sylvie   18.0   10.5
5           Grand Est     Université de Reims      Luc   20.0   18.5
6           Grand Est     Université de Reims     Marc   19.0   16.0
7           Grand Est     Université de Reims     Hugo   14.0   16.0

In [78]:
Grp = DF.groupby('Région')
print(Grp)
for R in Grp:
    print(R)
    print(R[0])

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f0c352d3850>
('Grand Est',       Région           Université   Nom  Spark  Scala
5  Grand Est  Université de Reims   Luc   20.0   18.5
6  Grand Est  Université de Reims  Marc   19.0   16.0
7  Grand Est  Université de Reims  Hugo   14.0   16.0)
Grand Est
('Ile-de-France',           Région           Université     Nom  Spark  Scala
3  Ile-de-France  Université de Paris  Thomas    7.5    9.0
4  Ile-de-France  Université de Paris  Sylvie   18.0   10.5)
Ile-de-France
('Normandie',       Région           Université      Nom  Spark  Scala
1  Normandie  Université de Rouen    Laura   14.5   10.0
2  Normandie  Université de Rouen  Sylvain   15.0   11.0)
Normandie
('Nouvelle-Aquitaine',                Région              Université     Nom  Spark  Scala
0  Nouvelle-Aquitaine  Université de Poitiers  Gilles   14.0   15.0)
Nouvelle-Aquitaine

In [79]:
for R, G in Grp:
    print(R)
    print("**********************")
    print(G)

Grand Est
**********************
      Région           Université   Nom  Spark  Scala
5  Grand Est  Université de Reims   Luc   20.0   18.5
6  Grand Est  Université de Reims  Marc   19.0   16.0
7  Grand Est  Université de Reims  Hugo   14.0   16.0
Ile-de-France
**********************
          Région           Université     Nom  Spark  Scala
3  Ile-de-France  Université de Paris  Thomas    7.5    9.0
4  Ile-de-France  Université de Paris  Sylvie   18.0   10.5
Normandie
**********************
      Région           Université      Nom  Spark  Scala
1  Normandie  Université de Rouen    Laura   14.5   10.0
2  Normandie  Université de Rouen  Sylvain   15.0   11.0
Nouvelle-Aquitaine
**********************
               Région              Université     Nom  Spark  Scala
0  Nouvelle-Aquitaine  Université de Poitiers  Gilles   14.0   15.0

In [81]:
DF.groupby(['Région', 'Université']).mean()

                                               Spark      Scala
Région             Université
Grand Est          Université de Reims     17.666667  16.833333
Ile-de-France      Université de Paris     12.750000   9.750000
Normandie          Université de Rouen     14.750000  10.500000
Nouvelle-Aquitaine Université de Poitiers  14.000000  15.000000

In [83]:
DF1 = pd.DataFrame({'Nom': ['Gilles', 'Sylvain'], 'Age': [25, 28]})
DF2 = pd.DataFrame({'Nom': ['Sylvie', 'Luc'], 'Age': [35, 50]})

print("DataFrame DF1:\n")
print(DF1)
print("\nDataFrame DF2:\n")
print(DF2)

DataFrame DF1:

       Nom  Age
0   Gilles   25
1  Sylvain   28

DataFrame DF2:

      Nom  Age
0  Sylvie   35
1     Luc   50

In [97]:
DF_Concat = pd.concat([DF1, DF2])

print("\nConcaténation:\n", DF_Concat)

print(DF_Concat.loc[0])
print(DF_Concat.iloc[2])

DF_Concat.index = range(4)

print(DF_Concat)
DF_Concat.loc[0]

Concaténation:
        Nom  Age
0   Gilles   25
1  Sylvain   28
0   Sylvie   35
1      Luc   50
      Nom  Age
0  Gilles   25
0  Sylvie   35
Nom    Sylvie
Age        35
Name: 0, dtype: object
       Nom  Age
0   Gilles   25
1  Sylvain   28
2   Sylvie   35
3      Luc   50

Nom    Gilles
Age        25
Name: 0, dtype: object

In [99]:
DF1 = pd.DataFrame({'Nom': ['Gilles', 'Sylvain'], 'Age': [25, 28]})
DF2 = pd.DataFrame({'Profession': ['Etudiant', 'Employé'], 'Tél': ['06-32-...', '06-21-...']})

print("DataFrame DF1:\n")
print(DF1)
print("\nDataFrame DF2:\n")
print(DF2)

DataFrame DF1:

       Nom  Age
0   Gilles   25
1  Sylvain   28

DataFrame DF2:

  Profession        Tél
0   Etudiant  06-32-...
1    Employé  06-21-...

In [100]:
DF_Concat = pd.concat([DF1, DF2], axis=1)

print("\nConcaténation:\n", DF_Concat)

Concaténation:
        Nom  Age Profession        Tél
0   Gilles   25   Etudiant  06-32-...
1  Sylvain   28    Employé  06-21-...

In [108]:
DF = pd.DataFrame(Dict)
print(DF)
DF.drop(6)

               Région              Université      Nom  Spark  Scala
0  Nouvelle-Aquitaine  Université de Poitiers   Gilles   14.0   15.0
1           Normandie     Université de Rouen    Laura   14.5   10.0
2           Normandie     Université de Rouen  Sylvain   15.0   11.0
3       Ile-de-France     Université de Paris   Thomas    7.5    9.0
4       Ile-de-France     Université de Paris   Sylvie   18.0   10.5
5           Grand Est     Université de Reims      Luc   20.0   18.5
6           Grand Est     Université de Reims     Marc   19.0   16.0
7           Grand Est     Université de Reims     Hugo   14.0   16.0

               Région              Université      Nom  Spark  Scala
0  Nouvelle-Aquitaine  Université de Poitiers   Gilles   14.0   15.0
1           Normandie     Université de Rouen    Laura   14.5   10.0
2           Normandie     Université de Rouen  Sylvain   15.0   11.0
3       Ile-de-France     Université de Paris   Thomas    7.5    9.0
4       Ile-de-France     Université de Paris   Sylvie   18.0   10.5
5           Grand Est     Université de Reims      Luc   20.0   18.5
7           Grand Est     Université de Reims     Hugo   14.0   16.0

In [109]:
DF = DF.drop(6)
del DF["Nom"]

In [110]:
DF

               Région              Université  Spark  Scala
0  Nouvelle-Aquitaine  Université de Poitiers   14.0   15.0
1           Normandie     Université de Rouen   14.5   10.0
2           Normandie     Université de Rouen   15.0   11.0
3       Ile-de-France     Université de Paris    7.5    9.0
4       Ile-de-France     Université de Paris   18.0   10.5
5           Grand Est     Université de Reims   20.0   18.5
7           Grand Est     Université de Reims   14.0   16.0

In [111]:
DF = pd.DataFrame({'A': range(1, 6),
                   'B': range(10, 0, -2),
                   'C': range(10, 5, -1)})

DF

   A   B   C
0  1  10  10
1  2   8   9
2  3   6   8
3  4   4   7
4  5   2   6

In [114]:
DF.query('A >= B')

   A  B  C
3  4  4  7
4  5  2  6

In [115]:
DF[DF.A >= DF.B]

   A  B  C
3  4  4  7
4  5  2  6

In [116]:
DF["D"] = DF["B"]/DF["C"]
DF

   A   B   C         D
0  1  10  10  1.000000
1  2   8   9  0.888889
2  3   6   8  0.750000
3  4   4   7  0.571429
4  5   2   6  0.333333